TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/m33/sysctl/hw_sysctl_mspm33c321x.h
/* SYSCTL_SYSPLLPARAM1 Bits */
/* SYSCTL_SYSPLLPARAM1[LPFCAPA] Bits */
#define SYSCTL_SYSPLLPARAM1_LPFCAPA_OFS          (0)                             /* !< LPFCAPA Offset */
#define SYSCTL_SYSPLLPARAM1_LPFCAPA_MASK         ((uint32_t)0x0000001FU)         /* !< Loop filter Cap A */
/* SYSCTL_SYSPLLPARAM1[LPFRESC] Bits */
#define SYSCTL_SYSPLLPARAM1_LPFRESC_OFS          (24)                            /* !< LPFRESC Offset */
#define SYSCTL_SYSPLLPARAM1_LPFRESC_MASK         ((uint32_t)0xFF000000U)         /* !< Loop filter Res C */
/* SYSCTL_SYSPLLPARAM1[LPFRESA] Bits */
#define SYSCTL_SYSPLLPARAM1_LPFRESA_OFS          (8)                             /* !< LPFRESA Offset */
#define SYSCTL_SYSPLLPARAM1_LPFRESA_MASK         ((uint32_t)0x0003FF00U)         /* !< Loop filter Res A */

/* SYSCTL_SYSPLLPARAM2 Bits */
/* SYSCTL_SYSPLLPARAM2[RNGFIXVCOIBIASCFG] Bits */
#define SYSCTL_SYSPLLPARAM2_RNGFIXVCOIBIASCFG_OFS (3)                             /* !< RNGFIXVCOIBIASCFG Offset */
#define SYSCTL_SYSPLLPARAM2_RNGFIXVCOIBIASCFG_MASK ((uint32_t)0x00000008U)         /* !< 0 value for Temperature
                                                                                    Compensation R addition */
/* SYSCTL_SYSPLLPARAM2[LPFCAPC] Bits */
#define SYSCTL_SYSPLLPARAM2_LPFCAPC_OFS          (0)                             /* !< LPFCAPC Offset */
#define SYSCTL_SYSPLLPARAM2_LPFCAPC_MASK         ((uint32_t)0x00000003U)         /* !< Loop filter Cap C */

/* SYSCTL_SYSPLLLDOCTL Bits */
/* SYSCTL_SYSPLLLDOCTL[LDOCTLLOWV] Bits */
#define SYSCTL_SYSPLLLDOCTL_LDOCTLLOWV_OFS       (0)                             /* !< LDOCTLLOWV Offset */
#define SYSCTL_SYSPLLLDOCTL_LDOCTLLOWV_MASK      ((uint32_t)0x0000FFFFU)         /* !< LDO Configurability */

/* SYSCTL_SYSPLLLDOPROG Bits */
/* SYSCTL_SYSPLLLDOPROG[LDOVOUTPROGLOWV] Bits */
#define SYSCTL_SYSPLLLDOPROG_LDOVOUTPROGLOWV_OFS (0)                             /* !< LDOVOUTPROGLOWV Offset */
#define SYSCTL_SYSPLLLDOPROG_LDOVOUTPROGLOWV_MASK ((uint32_t)0x00000007U)         /* !< HPLL LDO Vout Prog */

/* SYSCTL_GENCLKEN Bits */
/* SYSCTL_GENCLKEN[EXTDIVMCLK] Bits */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_OFS           (8)                             /* !< EXTDIVMCLK Offset */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_MASK          ((uint32_t)0x00000700U)         /* !< EXTDIVMCLK selects the divider
                                                                                    value for the divider for the PLL
                                                                                    Source MCLK. */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_DIV2          ((uint32_t)0x00000000U)         /* !< CLK_OUT source is divided by 2 */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_DIV4          ((uint32_t)0x00000100U)         /* !< CLK_OUT source is divided by 4 */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_DIV6          ((uint32_t)0x00000200U)         /* !< CLK_OUT source is divided by 6 */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_DIV8          ((uint32_t)0x00000300U)         /* !< CLK_OUT source is divided by 8 */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_DIV10         ((uint32_t)0x00000400U)         /* !< CLK_OUT source is divided by 10 */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_DIV12         ((uint32_t)0x00000500U)         /* !< CLK_OUT source is divided by 12 */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_DIV14         ((uint32_t)0x00000600U)         /* !< CLK_OUT source is divided by 14 */
#define SYSCTL_GENCLKEN_EXTDIVMCLK_DIV16         ((uint32_t)0x00000700U)         /* !< CLK_OUT source is divided by 16 */
/* SYSCTL_GENCLKEN[MFPCLKEN] Bits */
#define SYSCTL_GENCLKEN_MFPCLKEN_OFS             (4)                             /* !< MFPCLKEN Offset */
#define SYSCTL_GENCLKEN_MFPCLKEN_MASK            ((uint32_t)0x00000010U)         /* !< MFPCLKEN tied 0, since DAC is not
                                                                                    present */
#define SYSCTL_GENCLKEN_MFPCLKEN_DISABLE         ((uint32_t)0x00000000U)         /* !< MFPCLK is disabled */
#define SYSCTL_GENCLKEN_MFPCLKEN_ENABLE          ((uint32_t)0x00000010U)         /* !< MFPCLK is enabled */
/* SYSCTL_GENCLKEN[I2SPLLCLKDIVEN] Bits */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVEN_OFS       (18)                            /* !< I2SPLLCLKDIVEN Offset */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVEN_MASK      ((uint32_t)0x00040000U)         /* !< I2SPLLCLKDIVEN enables or disables
                                                                                    the divider function of the PLL
                                                                                    Source to I2S. */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVEN_PASSTHRU  ((uint32_t)0x00000000U)         /* !< CLock divider is disabled
                                                                                    (passthrough, I2SPLLCLKDIV is not
                                                                                    applied) */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVEN_ENABLE    ((uint32_t)0x00040000U)         /* !< Clock divider is enabled
                                                                                    (I2SPLLCLKDIV is applied) */
/* SYSCTL_GENCLKEN[EXCLKEN] Bits */
#define SYSCTL_GENCLKEN_EXCLKEN_OFS              (0)                             /* !< EXCLKEN Offset */
#define SYSCTL_GENCLKEN_EXCLKEN_MASK             ((uint32_t)0x00000001U)         /* !< EXCLKEN enables the CLK_OUT
                                                                                    external clock output block. */
#define SYSCTL_GENCLKEN_EXCLKEN_DISABLE          ((uint32_t)0x00000000U)         /* !< CLK_OUT block is disabled */
#define SYSCTL_GENCLKEN_EXCLKEN_ENABLE           ((uint32_t)0x00000001U)         /* !< CLK_OUT block is enabled */
/* SYSCTL_GENCLKEN[I2SPLLCLKDIVCFG] Bits */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVCFG_OFS      (16)                            /* !< I2SPLLCLKDIVCFG Offset */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVCFG_MASK     ((uint32_t)0x00030000U)         /* !< I2SPLLCLKDIVCFG selects the divider
                                                                                    value for the divider for the PLL
                                                                                    Source to CAN. */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVCFG_DIV4     ((uint32_t)0x00000000U)         /* !< CLK_OUT source is divided by 4 */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVCFG_DIV8     ((uint32_t)0x00010000U)         /* !< CLK_OUT source is divided by 8 */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVCFG_DIV12    ((uint32_t)0x00020000U)         /* !< CLK_OUT source is divided by 12 */
#define SYSCTL_GENCLKEN_I2SPLLCLKDIVCFG_DIV16    ((uint32_t)0x00030000U)         /* !< CLK_OUT source is divided by 16 */
/* SYSCTL_GENCLKEN[MCLKEXTDIVEN] Bits */
#define SYSCTL_GENCLKEN_MCLKEXTDIVEN_OFS         (11)                            /* !< MCLKEXTDIVEN Offset */
#define SYSCTL_GENCLKEN_MCLKEXTDIVEN_MASK        ((uint32_t)0x00000800U)         /* !< MCLKEXTDIVEN enables or disables
                                                                                    the divider function of the PLL
                                                                                    Source to MCLK. */
#define SYSCTL_GENCLKEN_MCLKEXTDIVEN_PASSTHRU    ((uint32_t)0x00000000U)         /* !< CLock divider is disabled
                                                                                    (passthrough, EXTDIVMCLK is not
                                                                                    applied) */
#define SYSCTL_GENCLKEN_MCLKEXTDIVEN_ENABLE      ((uint32_t)0x00000800U)         /* !< Clock divider is enabled
                                                                                    (EXTDIVMCLK is applied) */
/* SYSCTL_GENCLKEN[EXTDIVCAN] Bits */
#define SYSCTL_GENCLKEN_EXTDIVCAN_OFS            (12)                            /* !< EXTDIVCAN Offset */
#define SYSCTL_GENCLKEN_EXTDIVCAN_MASK           ((uint32_t)0x00007000U)         /* !< EXTDIVCAN selects the divider value
                                                                                    for the divider for the PLL Source to
                                                                                    CAN. */
#define SYSCTL_GENCLKEN_EXTDIVCAN_DIV2           ((uint32_t)0x00000000U)         /* !< CLK_OUT source is divided by 2 */
#define SYSCTL_GENCLKEN_EXTDIVCAN_DIV4           ((uint32_t)0x00001000U)         /* !< CLK_OUT source is divided by 4 */
#define SYSCTL_GENCLKEN_EXTDIVCAN_DIV6           ((uint32_t)0x00002000U)         /* !< CLK_OUT source is divided by 6 */
#define SYSCTL_GENCLKEN_EXTDIVCAN_DIV8           ((uint32_t)0x00003000U)         /* !< CLK_OUT source is divided by 8 */
#define SYSCTL_GENCLKEN_EXTDIVCAN_DIV10          ((uint32_t)0x00004000U)         /* !< CLK_OUT source is divided by 10 */
#define SYSCTL_GENCLKEN_EXTDIVCAN_DIV12          ((uint32_t)0x00005000U)         /* !< CLK_OUT source is divided by 12 */
#define SYSCTL_GENCLKEN_EXTDIVCAN_DIV14          ((uint32_t)0x00006000U)         /* !< CLK_OUT source is divided by 14 */
#define SYSCTL_GENCLKEN_EXTDIVCAN_DIV16          ((uint32_t)0x00007000U)         /* !< CLK_OUT source is divided by 16 */
/* SYSCTL_GENCLKEN[CANEXTDIVEN] Bits */
#define SYSCTL_GENCLKEN_CANEXTDIVEN_OFS          (15)                            /* !< CANEXTDIVEN Offset */
#define SYSCTL_GENCLKEN_CANEXTDIVEN_MASK         ((uint32_t)0x00008000U)         /* !< CANEXTDIVEN enables or disables the
                                                                                    divider function of the PLL Source to
                                                                                    CAN. */
#define SYSCTL_GENCLKEN_CANEXTDIVEN_PASSTHRU     ((uint32_t)0x00000000U)         /* !< CLock divider is disabled
                                                                                    (passthrough, EXTDIVCAN is not
                                                                                    applied) */
#define SYSCTL_GENCLKEN_CANEXTDIVEN_ENABLE       ((uint32_t)0x00008000U)         /* !< Clock divider is enabled (EXTDIVCAN
                                                                                    is applied) */

