TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/m33/sysctl/hw_sysctl_mspm33c321x.h
/* SYSCTL_PMULDOSPARECTL Bits */
/* SYSCTL_PMULDOSPARECTL[SPARECTRL] Bits */
#define SYSCTL_PMULDOSPARECTL_SPARECTRL_OFS      (0)                             /* !< SPARECTRL Offset */
#define SYSCTL_PMULDOSPARECTL_SPARECTRL_MASK     ((uint32_t)0x0000000FU)         /* !< Spare PMU LDO control for M33 */

/* SYSCTL_SYSCTL_ECO_REG1 Bits */
/* SYSCTL_SYSCTL_ECO_REG1[ECOREG] Bits */
#define SYSCTL_SYSCTL_ECO_REG1_ECOREG_OFS        (0)                             /* !< ECOREG Offset */
#define SYSCTL_SYSCTL_ECO_REG1_ECOREG_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< ECO Reg 1 for M33 */

/* SYSCTL_SYSCTL_ECO_REG2 Bits */
/* SYSCTL_SYSCTL_ECO_REG2[ECOREG] Bits */
#define SYSCTL_SYSCTL_ECO_REG2_ECOREG_OFS        (0)                             /* !< ECOREG Offset */
#define SYSCTL_SYSCTL_ECO_REG2_ECOREG_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< ECO Reg 2 for M33 */

/* SYSCTL_SRAMBOUNDARY Bits */
/* SYSCTL_SRAMBOUNDARY[ADDR] Bits */
#define SYSCTL_SRAMBOUNDARY_ADDR_OFS             (5)                             /* !< ADDR Offset */
#define SYSCTL_SRAMBOUNDARY_ADDR_MASK            ((uint32_t)0x000FFFE0U)         /* !< Not used, GSC register is used for
                                                                                    SRAM boundary configuration */

/* SYSCTL_SRAMBOUNDARYHIGH Bits */
/* SYSCTL_SRAMBOUNDARYHIGH[ADDR] Bits */
#define SYSCTL_SRAMBOUNDARYHIGH_ADDR_OFS         (5)                             /* !< ADDR Offset */
#define SYSCTL_SRAMBOUNDARYHIGH_ADDR_MASK        ((uint32_t)0x000FFFE0U)         /* !< Not used, GSC register is used for
                                                                                    SRAM boundary configuration */

/* SYSCTL_SYSTEMCFG Bits */
/* SYSCTL_SYSTEMCFG[KEY] Bits */
#define SYSCTL_SYSTEMCFG_KEY_OFS                 (24)                            /* !< KEY Offset */
#define SYSCTL_SYSTEMCFG_KEY_MASK                ((uint32_t)0xFF000000U)         /* !< The key value of 1Bh (27) must be
                                                                                    written to KEY together with contents
                                                                                    to be updated. Reads as 0 */
#define SYSCTL_SYSTEMCFG_KEY_VALUE               ((uint32_t)0x1B000000U)         /* !< Issue write */
/* SYSCTL_SYSTEMCFG[FLASHECCRSTDIS] Bits */
#define SYSCTL_SYSTEMCFG_FLASHECCRSTDIS_OFS      (2)                             /* !< FLASHECCRSTDIS Offset */
#define SYSCTL_SYSTEMCFG_FLASHECCRSTDIS_MASK     ((uint32_t)0x00000004U)         /* !< FLASHECCRSTDIS specifies whether a
                                                                                    flash ECC double error detect (DED)
                                                                                    will trigger a SYSRST or an NMI. */
#define SYSCTL_SYSTEMCFG_FLASHECCRSTDIS_FALSE    ((uint32_t)0x00000000U)         /* !< Flash ECC DED will trigger a SYSRST */
#define SYSCTL_SYSTEMCFG_FLASHECCRSTDIS_TRUE     ((uint32_t)0x00000004U)         /* !< Flash ECC DED will trigger a NMI */
/* SYSCTL_SYSTEMCFG[WWDTLP0RSTDIS] Bits */
#define SYSCTL_SYSTEMCFG_WWDTLP0RSTDIS_OFS       (0)                             /* !< WWDTLP0RSTDIS Offset */
#define SYSCTL_SYSTEMCFG_WWDTLP0RSTDIS_MASK      ((uint32_t)0x00000001U)         /* !< WWDTLP0RSTDIS specifies whether a
                                                                                    WWDT Error Event will trigger a
                                                                                    BOOTRST or an NMI. */
#define SYSCTL_SYSTEMCFG_WWDTLP0RSTDIS_FALSE     ((uint32_t)0x00000000U)         /* !< WWDTLP0 Error Event will trigger a
                                                                                    BOOTRST */
#define SYSCTL_SYSTEMCFG_WWDTLP0RSTDIS_TRUE      ((uint32_t)0x00000001U)         /* !< WWDTLP0 Error Event will trigger an
                                                                                    NMI */
/* SYSCTL_SYSTEMCFG[SUPERCAPEN] Bits */
#define SYSCTL_SYSTEMCFG_SUPERCAPEN_OFS          (8)                             /* !< SUPERCAPEN Offset */
#define SYSCTL_SYSTEMCFG_SUPERCAPEN_MASK         ((uint32_t)0x00000100U)         /* !< SUPERCAP specifies whether the
                                                                                    battery backup system can be powered
                                                                                    by a SUPERCAP */
#define SYSCTL_SYSTEMCFG_SUPERCAPEN_FALSE        ((uint32_t)0x00000000U)         /* !< SUPERCAP Function is not enabled */
#define SYSCTL_SYSTEMCFG_SUPERCAPEN_TRUE         ((uint32_t)0x00000100U)         /* !< SUPERCAP Function is not enabled */

/* SYSCTL_SRAMCFG Bits */
/* SYSCTL_SRAMCFG[KEY] Bits */
#define SYSCTL_SRAMCFG_KEY_OFS                   (24)                            /* !< KEY Offset */
#define SYSCTL_SRAMCFG_KEY_MASK                  ((uint32_t)0xFF000000U)         /* !< The key value of B5h (181) must be
                                                                                    written to KEY together with contents
                                                                                    to be updated. Reads as 0 */
#define SYSCTL_SRAMCFG_KEY_VALUE                 ((uint32_t)0xB5000000U)         /* !< Issue write */
/* SYSCTL_SRAMCFG[BANKINITDIS3] Bits */
#define SYSCTL_SRAMCFG_BANKINITDIS3_OFS          (19)                            /* !< BANKINITDIS3 Offset */
#define SYSCTL_SRAMCFG_BANKINITDIS3_MASK         ((uint32_t)0x00080000U)         /* !< SRAM BANK3 Initialization */
#define SYSCTL_SRAMCFG_BANKINITDIS3_FALSE        ((uint32_t)0x00000000U)         /* !< SRAM BANK3 will Initialize when
                                                                                    transitioning from OFF to ON */
#define SYSCTL_SRAMCFG_BANKINITDIS3_TRUE         ((uint32_t)0x00080000U)         /* !< SRAM BANK3 will NOT Initialize when
                                                                                    transitioning from OFF to ON */
/* SYSCTL_SRAMCFG[BANKOFF2] Bits */
#define SYSCTL_SRAMCFG_BANKOFF2_OFS              (2)                             /* !< BANKOFF2 Offset */
#define SYSCTL_SRAMCFG_BANKOFF2_MASK             ((uint32_t)0x00000004U)         /* !< Not used */
#define SYSCTL_SRAMCFG_BANKOFF2_FALSE            ((uint32_t)0x00000000U)         /* !< SRAM BANK2 power ON for RUN mode */
#define SYSCTL_SRAMCFG_BANKOFF2_TRUE             ((uint32_t)0x00000004U)         /* !< SRAM BANK2 power OFF for RUN mode */
/* SYSCTL_SRAMCFG[BANKINITDIS2] Bits */
#define SYSCTL_SRAMCFG_BANKINITDIS2_OFS          (18)                            /* !< BANKINITDIS2 Offset */
#define SYSCTL_SRAMCFG_BANKINITDIS2_MASK         ((uint32_t)0x00040000U)         /* !< SRAM BANK2 Initialization */
#define SYSCTL_SRAMCFG_BANKINITDIS2_FALSE        ((uint32_t)0x00000000U)         /* !< SRAM BANK2 will Initialize when
                                                                                    transitioning from OFF to ON */
#define SYSCTL_SRAMCFG_BANKINITDIS2_TRUE         ((uint32_t)0x00040000U)         /* !< SRAM BANK2 will NOT Initialize when
                                                                                    transitioning from OFF to ON */
/* SYSCTL_SRAMCFG[BANKOFF1] Bits */
#define SYSCTL_SRAMCFG_BANKOFF1_OFS              (1)                             /* !< BANKOFF1 Offset */
#define SYSCTL_SRAMCFG_BANKOFF1_MASK             ((uint32_t)0x00000002U)         /* !< Not used */
#define SYSCTL_SRAMCFG_BANKOFF1_FALSE            ((uint32_t)0x00000000U)         /* !< SRAM BANK1 power ON for RUN mode */
#define SYSCTL_SRAMCFG_BANKOFF1_TRUE             ((uint32_t)0x00000002U)         /* !< SRAM BANK1 power OFF for RUN mode */
/* SYSCTL_SRAMCFG[BANKOFF3] Bits */
#define SYSCTL_SRAMCFG_BANKOFF3_OFS              (3)                             /* !< BANKOFF3 Offset */
#define SYSCTL_SRAMCFG_BANKOFF3_MASK             ((uint32_t)0x00000008U)         /* !< Not used */
#define SYSCTL_SRAMCFG_BANKOFF3_FALSE            ((uint32_t)0x00000000U)         /* !< SRAM BANK3 power ON for RUN mode */
#define SYSCTL_SRAMCFG_BANKOFF3_TRUE             ((uint32_t)0x00000008U)         /* !< SRAM BANK3 power OFF for RUN mode */
/* SYSCTL_SRAMCFG[BANKINITDIS1] Bits */
#define SYSCTL_SRAMCFG_BANKINITDIS1_OFS          (17)                            /* !< BANKINITDIS1 Offset */
#define SYSCTL_SRAMCFG_BANKINITDIS1_MASK         ((uint32_t)0x00020000U)         /* !< SRAM BANK1 Initialization */
#define SYSCTL_SRAMCFG_BANKINITDIS1_FALSE        ((uint32_t)0x00000000U)         /* !< SRAM BANK1 will Initialize when
                                                                                    transitioning from OFF to ON */
#define SYSCTL_SRAMCFG_BANKINITDIS1_TRUE         ((uint32_t)0x00020000U)         /* !< SRAM BANK1 will NOT Initialize when
                                                                                    transitioning from OFF to ON */

