TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/m33/sysctl/hw_sysctl_mspm33c321x.h
/* SYSCTL_ADCSEQFRCGB Bits */
/* SYSCTL_ADCSEQFRCGB[SEQ3] Bits */
#define SYSCTL_ADCSEQFRCGB_SEQ3_OFS              (3)                             /* !< SEQ3 Offset */
#define SYSCTL_ADCSEQFRCGB_SEQ3_MASK             ((uint32_t)0x00000008U)         /* !< Generate synchronous SW trigger for
                                                                                    SEQ3 */
/* SYSCTL_ADCSEQFRCGB[SEQ2] Bits */
#define SYSCTL_ADCSEQFRCGB_SEQ2_OFS              (2)                             /* !< SEQ2 Offset */
#define SYSCTL_ADCSEQFRCGB_SEQ2_MASK             ((uint32_t)0x00000004U)         /* !< Generate synchronous SW trigger for
                                                                                    SEQ2 */
/* SYSCTL_ADCSEQFRCGB[SEQ0] Bits */
#define SYSCTL_ADCSEQFRCGB_SEQ0_OFS              (0)                             /* !< SEQ0 Offset */
#define SYSCTL_ADCSEQFRCGB_SEQ0_MASK             ((uint32_t)0x00000001U)         /* !< Generate synchronous SW trigger for
                                                                                    SEQ0 */
/* SYSCTL_ADCSEQFRCGB[SEQ1] Bits */
#define SYSCTL_ADCSEQFRCGB_SEQ1_OFS              (1)                             /* !< SEQ1 Offset */
#define SYSCTL_ADCSEQFRCGB_SEQ1_MASK             ((uint32_t)0x00000002U)         /* !< Generate synchronous SW trigger for
                                                                                    SEQ1 */

/* SYSCTL_ADCSEQFRCGBSEL Bits */
/* SYSCTL_ADCSEQFRCGBSEL[ADCB] Bits */
#define SYSCTL_ADCSEQFRCGBSEL_ADCB_OFS           (1)                             /* !< ADCB Offset */
#define SYSCTL_ADCSEQFRCGBSEL_ADCB_MASK          ((uint32_t)0x00000002U)         /* !< Generate synchronous SW trigger for
                                                                                    ADCB */
/* SYSCTL_ADCSEQFRCGBSEL[ADCA] Bits */
#define SYSCTL_ADCSEQFRCGBSEL_ADCA_OFS           (0)                             /* !< ADCA Offset */
#define SYSCTL_ADCSEQFRCGBSEL_ADCA_MASK          ((uint32_t)0x00000001U)         /* !< Generate synchronous SW trigger for
                                                                                    ADCA */

/* SYSCTL_M33SPARESOCLOCK1 Bits */
/* SYSCTL_M33SPARESOCLOCK1[SPARE] Bits */
#define SYSCTL_M33SPARESOCLOCK1_SPARE_OFS        (0)                             /* !< SPARE Offset */
#define SYSCTL_M33SPARESOCLOCK1_SPARE_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Spare SOC LOCK Register 1 */

/* SYSCTL_M33SPARESOCLOCK2 Bits */
/* SYSCTL_M33SPARESOCLOCK2[SPARE] Bits */
#define SYSCTL_M33SPARESOCLOCK2_SPARE_OFS        (0)                             /* !< SPARE Offset */
#define SYSCTL_M33SPARESOCLOCK2_SPARE_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Spare SOC LOCK Register 2 */

/* SYSCTL_SYSCTL_READ_REG Bits */
/* SYSCTL_SYSCTL_READ_REG[ECOREG] Bits */
#define SYSCTL_SYSCTL_READ_REG_ECOREG_OFS        (0)                             /* !< ECOREG Offset */
#define SYSCTL_SYSCTL_READ_REG_ECOREG_MASK       ((uint32_t)0xFFFFFFFFU)         /* !< Read only register */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_m33_hw_sysctl_mspm33c321x__include */
